# RAG Система для документов перевозчиков

## Обзор

Эта RAG (Retrieval-Augmented Generation) система предназначена для индексации и поиска по документам перевозчиков (ПЭК, СДЭК, Почта России) с использованием векторных эмбеддингов.

## Функциональность

- **Индексация документов**: Автоматическая загрузка и обработка текстовых файлов из папки `data/carriers/`
- **Две стратегии чанкинга**: Фиксированный размер (500 символов) и разбиение по предложениям
- **Векторный поиск**: Использование модели `sentence-transformers/paraphrase-multilingual-MiniLM-L12-v2`
- **Локальное хранение**: FAISS для векторного индекса и SQLite для метаданных
- **Сравнение стратегий**: Автоматическое сравнение эффективности разных подходов

## Установка зависимостей

```bash
pip install sentence-transformers faiss-cpu sqlite3
```

## Использование

### Запуск индексации

```bash
python indexer.py
```

Система автоматически:
1. Загрузит все документы из `data/carriers/`
2. Создаст чанки по обеим стратегиям
3. Сгенерирует эмбеддинги
4. Сохранит индекс в файлы `faiss_index` и `metadata.db`

### Использование в коде

```python
from indexer import RAGIndexer

# Инициализация
indexer = RAGIndexer()

# Индексация документов
stats = indexer.index_documents()

# Поиск
results = indexer.search("стоимость доставки до 50 кг", top_k=3)

for result in results:
    print(f"Файл: {result['filename']}")
    print(f"Сходство: {result['similarity_score']:.4f}")
    print(f"Текст: {result['text'][:200]}...")
```

## Структура файлов

### Входные данные
- `data/carriers/` - папка с документами перевозчиков
- Поддерживаемые форматы: `.txt` файлы

### Выходные данные
- `faiss_index` - бинарный файл векторного индекса
- `metadata.db` - SQLite база с метаданными чанков

## Архитектура

### Компоненты системы

1. **DocumentLoader** - загрузка документов из файловой системы
2. **Chunker** - разбиение текста на чанки
3. **EmbeddingModel** - генерация векторных эмбеддингов
4. **FAISSIndex** - управление векторным индексом
5. **MetadataDB** - хранение метаданных в SQLite
6. **RAGIndexer** - основной класс, координирующий все компоненты

### Стратегии чанкинга

#### Фиксированный размер
- Размер чанка: 500 символов
- Перекрытие: 50 символов
- Преимущества: равномерное распределение информации

#### По предложениям
- Разбиение по границам предложений
- Автоматическое объединение коротких предложений
- Преимущества: сохранение смысловой целостности

## Примеры использования

### Тестовые запросы

```python
# Поиск информации о тарифах
results = indexer.search("тариф Москва Санкт-Петербург")

# Поиск условий перевозки
results = indexer.search("условия перевозки опасных грузов")

# Поиск стоимости доставки
results = indexer.search("стоимость доставки 50 кг")
```

### Рекомендации по формулировке запросов

Для лучших результатов используйте:
- Ключевые слова из документов
- Конкретные термины ("тариф", "доставка", "Москва", "50 кг")
- Избегайте общих фраз ("сколько стоит", "как отправить")

## Производительность

Система оптимизирована для работы на CPU:
- Модель эмбеддингов: легковесная multilingual-MiniLM-L12-v2
- FAISS индекс: быстрый поиск по векторам
- SQLite: эффективное хранение метаданных

Типичное время индексации для 5 документов: 3-5 секунд

## Ограничения

- Поддерживаются только текстовые файлы
- Максимальный размер документа: ограничениями оперативной памяти
- Для больших объемов данных рекомендуется использовать GPU

## Разработка

### Добавление новых документов

1. Поместите файлы в папку `data/carriers/`
2. Перезапустите индексацию: `python indexer.py`

### Изменение параметров

Можно настроить в коде:
- Размер чанка и перекрытие
- Модель эмбеддингов
- Количество возвращаемых результатов

## Лицензия

Проект распространяется под лицензией проекта Logsit Agent.